/* Copyright 2019, Tencent Technology (Shenzhen) Co Ltd
 
 This file is part of the Tencent SM (Lite Version) Library.
 
 The Tencent SM (Lite Version) Library is free software; you can redistribute it and/or modify
 it under the terms of either:
 
 * the GNU Lesser General Public License as published by the Free
 Software Foundation; either version 3 of the License, or (at your
 option) any later version.
 
 or
 
 * the GNU General Public License as published by the Free Software
 Foundation; either version 2 of the License, or (at your option) any
 later version.
 
 or both in parallel, as here.
 
 The Tencent SM (Lite Version) Library is distributed in the hope that it will be useful, but
 WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY
 or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License
 for more details.
 
 You should have received copies of the GNU General Public License and the
 GNU Lesser General Public License along with the Tencent SM (Lite Version) Library.  If not,
 see https://www.gnu.org/licenses/.  */

#include "include/tc_global.h"
#include "include/tc_sm2.h"
#include "include/tc_sm3.h"
#include "include/tc_kms.h"
#include "include/tc_str.h"
#include "include/tc_kdf.h"
#include "include/tc_utils.h"
#include "include/tc_rand.h"
#include "include/tlv.h"

#include <unistd.h>
#include <sys/types.h>
#include <sys/stat.h>
#include <fcntl.h>
#include <stdlib.h>
#include "include/sm_jni.h"

#define KMS_FILE_HEADER ""
#define KMS_FILE_PATH_MAX_LENGTH 4096
#define KMS_PUBKEY_MAX_LENGTH 200
#define KMS_PRIKEY_MAX_LENGTH 100

typedef int kms_bool;

typedef struct key {
    uint8_t *data; // 0x1
} key;

typedef struct key_pair {
    uint8_t *pub_key; //0x1
    uint8_t *pri_key; //0x2
} key_pair;

#define KEY_TYPE         0x1
#define KEY_PAIR_TYPE    0x2

typedef struct key_info {
    uint8_t *des; //0x1
    uint16_t type; //0x2
    key k; //0x3
} key_info;

typedef struct key_pair_info {
    uint8_t *des; //0x1
    uint16_t type; //0x2
    key_pair kp;  //0x3
} key_pair_info;

void tc_kms_secret_salt(unsigned char *secret_salt)
{
    int a = 0x5309fd23;
    int b = 0x902b01b2;
    int c = 0xaff5072b;
    int d = 0x3ef6eacc;
    int e = 0x5476e841;
    int f = 0x902c87c3;
    int g = 0xae5f0df1;
    int h = 0x2bf78b98;
    
    unsigned char c1 = a^b;
    unsigned char c2 = c^d;
    unsigned char c3 = e^f;
    unsigned char c4 = g^h;
    unsigned char c5 = a^h;
    unsigned char c6 = b^g;
    unsigned char c7 = c^f;
    unsigned char c8 = d^e;
    
    unsigned char local_md[32];
    
    sm3_ctx_t md_ctx;
    tcsm_sm3_init_opt(&md_ctx);
    tcsm_sm3_update_opt(&md_ctx, &c1, 1);
    tcsm_sm3_update_opt(&md_ctx, &c2, 1);
    tcsm_sm3_update_opt(&md_ctx, &c3, 1);
    tcsm_sm3_update_opt(&md_ctx, &c4, 1);
    tcsm_sm3_update_opt(&md_ctx, &c5, 1);
    tcsm_sm3_update_opt(&md_ctx, &c6, 1);
    tcsm_sm3_update_opt(&md_ctx, &c7, 1);
    tcsm_sm3_update_opt(&md_ctx, &c8, 1);
    tcsm_sm3_final_opt(&md_ctx, local_md);
